app/controllers/articles_controller.rb

SELECT "categories".* FROM "categories"
---
  def create
    @categories = Category.all