app/controllers/articles_controller.rb

	def index
		@articles = Article.all.where(is_published: true)
---
SELECT "articles".* FROM "articles" WHERE "articles"."is_published" = 't'