app/controllers/articles_controller.rb

  def index
    @category = Category.find(params[:id])
    @articles = @category.articles.all
---
SELECT "articles".* FROM "articles"

  def create

    # binding.pry
    @article = Article.new(article_params)
    @article.categories = Category.find(params[:article][:category_ids].reject!(&:blank?))


    if @article.save
---
INSERT INTO "articles" ("anonce", "created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["anonce", "hdfghdfghdfg"], ["created_at", Wed, 01 Oct 2014 14:45:49 UTC +00:00], ["text", "dfghdfghfg"], ["title", "Моя первая статья"], ["updated_at", Wed, 01 Oct 2014 14:45:49 UTC +00:00]]

  def edit

    @article = Article.find(params[:id])
    @categories = Category.all
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "categories".* FROM "categories"

  def update
    @article = Article.find(params[:id])
    # binding.pry
    @article.categories = Category.find(params[:article][:category_ids].reject!(&:blank?))

  	if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["title", "New application"], ["text", "There is an application for study languages"], ["updated_at", Wed, 20 Aug 2014 15:50:23 UTC +00:00]]