app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])

    if params[:comment][:parent_id].present?
      @comment = @article.comments.find(params[:comment][:parent_id]).children.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["body", "wow!"], ["commenter", "Kate"], ["created_at", Wed, 20 Aug 2014 16:33:58 UTC +00:00], ["updated_at", Wed, 20 Aug 2014 16:33:58 UTC +00:00]]