app/controllers/persons_controller.rb

  def update
    @user = current_user
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = 2  [["name", "Henry Caville"], ["updated_at", Thu, 25 Sep 2014 08:18:44 UTC +00:00]]